In [2]:
import pandas as pd

In [3]:
df = pd.read_excel("Summary_2025.xlsx", sheet_name="Donasi")

In [4]:
df.head()

,No,Invoice ID,Donatur,Sapaan,Nominal,Kode Unik,Total,Whatsapp,Email,Comment,...,Payment Number,Payment Account,Payment Status,Fundraiser Commission,Fundraiser Name,Date,Day,Time,UTM Source,UTM Medium
0,1,INV-250602HR2DW,Ulul Albab,Bapak,1000000,52,1002827,8.133157e+10,NaN,NaN,...,9886556100000000000410658,BNI VA,Success,10028.0,Teman Baik 1,2025-06-02,Mon,12:25:00,ig,paid
1,2,INV-2506021N8LW,MUHAMMAD ARDAN MAULANA,Bapak,100000,541,100541,8.225054e+10,NaN,NaN,...,https://flip.id/pwf/transaction/consolidated?r...,QRIS,Success,1005.0,Teman Baik 1,2025-06-02,Mon,12:00:00,fb,paid
2,3,INV-250602BTJQA,MUHAMMAD ARDAN MAULANA,Kak,100000,496,100496,8.225054e+10,NaN,NaN,...,https://flip.id/pwf/transaction/consolidated?r...,QRIS,Waiting,1005.0,Teman Baik 1,2025-06-02,Mon,11:59:00,fb,paid
3,4,INV-250602WB3CW,Syahrul habib lubis,Kak,100000,682,103457,8.576357e+10,syahrulhabib66@gmail.com,Semoga saudara kita di sana dalam lindungan al...,...,145520000002585312,BRI VA,Success,1035.0,Teman Baik 1,2025-06-02,Mon,11:16:00,ig,paid
4,5,INV-25060252GCF,Hamba Allah,Bapak,100000,979,100979,8.136845e+10,NaN,Semoga kita semua selalu dalam lindungan Allah...,...,https://m.dana.id/s/bypub5lc,DANA,Success,1010.0,Teman Baik 1,2025-06-02,Mon,11:15:00,fb,paid

In [5]:
first = df.groupby('Whatsapp').agg(
    first_transaction=("Date", "first")
).reset_index()

In [6]:
first

           Whatsapp first_transaction
0      0.000000e+00        2025-06-01
1      8.124821e-02        2025-04-23
2      8.137213e-02        2025-05-30
3      8.888800e+04        2025-05-09
4      8.123456e+06        2025-04-23
...             ...               ...
10114  8.946485e+12        2025-04-27
10115  8.990001e+12        2025-04-14
10116  1.111111e+13        2025-04-11
10117  8.076464e+13        2025-05-08
10118  8.517672e+13        2025-04-09

[10119 rows x 2 columns]

In [7]:
first['first_transaction'] = first['first_transaction'].dt.month

In [9]:
first['Whatsapp'] = first['Whatsapp'].astype(int)

In [10]:
def is_random_number(num):
    num = str(num)

    # Nomor harus hanya angka
    if not num.isdigit():
        return False

    # Harus valid dari segi panjang dan awalan
    starts_valid = num.startswith("08") or num.startswith("8") or num.startswith("62")
    length_valid = 8 < len(num) <= 14

    if not (starts_valid and length_valid):
        return False

    # Cek jika terlalu banyak angka sama (seperti 08888888888)
    if len(set(num)) <= 3:
        return False

    # Cek pola berulang (seperti 081234567812345678)
    if len(num) > 6 and num[:int(len(num)/2)] == num[int(len(num)/2):]:
        return False

    # Cek pola urutan (seperti 08123456789)
    if num[2:].isdigit() and num[2:] in '1234567890'*2:
        return False

    return True

first['valid_number'] = first['Whatsapp'].apply(is_random_number)

In [11]:
first.sort_values(by='first_transaction')

         Whatsapp  first_transaction  valid_number
2932  81329198579                  2          True
6252  82380878760                  2          True
1019   8226357000                  2          True
7298  85268783688                  2          True
4846  82157720711                  2          True
...           ...                ...           ...
1807  81248591515                  6          True
1812  81249559392                  6          True
1819  81250318628                  6          True
1634  81234727374                  6          True
0               0                  6         False

[10119 rows x 3 columns]

In [17]:
first.groupby('first_transaction')['valid_number'].value_counts().reset_index()

   first_transaction  valid_number  count
0                  2          True     11
1                  3          True   1072
2                  3         False     10
3                  4          True   3885
4                  4         False     37
5                  5          True   4764
6                  5         False     40
7                  6          True    297
8                  6         False      3